#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Notes on memory coalescing in Futhark
#+date: <2021-08-27 Fri>
#+author: Philip Munksgaard
#+email: philip@munksgaard.me
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.2 (Org mode 9.4.4)


*** DONE hotspot
:LOGBOOK:
CLOCK: [2022-02-21 Mon 14:52]--[2022-02-21 Mon 15:17] =>  0:25
CLOCK: [2022-02-21 Mon 14:21]--[2022-02-21 Mon 14:46] =>  0:25
CLOCK: [2022-02-21 Mon 13:49]--[2022-02-21 Mon 14:14] =>  0:25
:END:

